bog-app/app/controllers/creatures_controller.rb

  def create
    creature = Creature.new(creature_params)
    if creature.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Monster"], ["description", "Rawwwrrrr"], ["created_at", 2016-10-02 21:44:36 UTC], ["updated_at", 2016-10-02 21:44:36 UTC]]

  def show
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def edit
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature.update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "Little green man with a light saber"], ["updated_at", 2016-10-02 21:51:53 UTC], ["id", 1]]

  def destroy
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature.destroy
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 1]]